In [ ]:
# Why Pandas

# Simple to use
# Integrated with many other data science & ML Python tools
# Helps you get your data ready for machine learning

In [2]:
# What are we going to cover?

# Most useful functions
# pandas Datatypes
# Importing & exporting data
# Describing data
# Viewing & selecting data
# Manipulating data

In [1]:
import pandas as pd

In [2]:
# 2 main datatypes
series = pd.Series(["BMW", "Toyota", "Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
# series = 1D

In [5]:
colours = pd.Series(["Red", "Blue", "White"])
colours

0      Red
1     Blue
2    White
dtype: object

In [6]:
# DataFrame = 2D (It's far more common then series)

In [7]:
car_data = pd.DataFrame({ "Car Make": series, "Colour": colours })
car_data

  Car Make Colour
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [8]:
car_sales = pd.read_csv("car-sales.csv")

In [9]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [10]:
# axis=1 column
# axis=0 row

In [14]:
# Exporting a dataframe
# car_sales.to_csv("exported-car-sales.csv")
car_sales.to_csv("exported-car-sales.csv", index=False)

!["Anatomy"](pandas-anatomy-of-a-dataframe.png)